In [77]:
print ('Hello, Welcome to your Machine Learning Module')

Hello, Welcome to your Machine Learning Module

In [78]:
pip

Usage:
  g:\ML\python.exe -m pip <command> [options]

Commands:
  install                     Install packages.
  download                    Download packages.
  uninstall                   Uninstall packages.
  freeze                      Output installed packages in requirements format.
  inspect                     Inspect the python environment.
  list                        List installed packages.
  show                        Show information about installed packages.
  check                       Verify installed packages have compatible dependencies.
  config                      Manage local and global configuration.
  search                      Search PyPI for packages.
  cache                       Inspect and manage pip's wheel cache.
  index                       Inspect information available from package indexes.
  wheel                       Build wheels from your requirements.
  hash                        Compute hashes of package archives.
  completion                  A helper command used for command completion.
  debug                       Show information useful for debugging.
  help                        Show help for commands.

General Options:
  -h, --help                  Show help.
  --debug                     Let unhandled exceptions propagate outside the
                              main subroutine, instead of logging them to
                              stderr.
  --isolated                  Run pip in an isolated mode, ignoring
                              environment variables and user configuration.
  --require-virtualenv        Allow pip to only run in a virtual environment;
                              exit with an error otherwise.
  --python <python>           Run pip with the specified Python interpreter.
  -v, --verbose               Give more output. Option is additive, and can be
                              used up to 3 times.
  -V, --version               Show version and exit.
  -q, --quiet                 Give less output. Option is additive, and can be
                              used up to 3 times (corresponding to WARNING,
                              ERROR, and CRITICAL logging levels).
  --log <path>                Path to a verbose appending log.
  --no-input                  Disable prompting for input.
  --keyring-provider <keyring_provider>
                              Enable the credential lookup via the keyring
                              library if user input is allowed. Specify which
                              mechanism to use [disabled, import, subprocess].
                              (default: disabled)
  --proxy <proxy>             Specify a proxy in the form
                              scheme://[user:passwd@]proxy.server:port.
  --retries <retries>         Maximum number of retries each connection should
                              attempt (default 5 times).
  --timeout <sec>             Set the socket timeout (default 15 seconds).
  --exists-action <action>    Default action when a path already exists:
                              (s)witch, (i)gnore, (w)ipe, (b)ackup, (a)bort.
  --trusted-host <hostname>   Mark this host or host:port pair as trusted,
                              even though it does not have valid or any HTTPS.
  --cert <path>               Path to PEM-encoded CA certificate bundle. If
                              provided, overrides the default. See 'SSL
                              Certificate Verification' in pip documentation
                              for more information.
  --client-cert <path>        Path to SSL client certificate, a single file
                              containing the private key and the certificate
                              in PEM format.
  --cache-dir <dir>           Store the cache data in <dir>.
  --no-cache-dir              Disable the cache.
  --disable-pip-version-check
                              Don't periodically check PyPI to determine
                              whether a new version of pip is available for
                              download. Implied with --no-index.
  --no-color                  Suppress colored output.
  --no-python-version-warning
                              Silence deprecation warnings for upcoming
                              unsupported Pythons.
  --use-feature <feature>     Enable new functionality, that may be backward
                              incompatible.
  --use-deprecated <feature>  Enable deprecated functionality, that will be
                              removed in the future.
Note: you may need to restart the kernel to use updated packages.

In [79]:
pip install pandas

Requirement already satisfied: pandas in g:\ml\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in g:\ml\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in g:\ml\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in g:\ml\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in g:\ml\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in g:\ml\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [80]:
import pandas as pd

In [81]:
dataset = pd.read_csv("Mall_Customers.csv")
dataset

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                     NaN
1             2    Male   NaN                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                 NaN                    77.0
4             5  Female   NaN                 NaN                    40.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                    83.0

[200 rows x 5 columns]

In [82]:
dataset.to_string()

'     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)\n0             1    Male  19.0                15.0                     NaN\n1             2    Male   NaN                15.0                    81.0\n2             3  Female  20.0                16.0                     6.0\n3             4  Female  23.0                 NaN                    77.0\n4             5  Female   NaN                 NaN                    40.0\n5             6  Female  22.0                17.0                    76.0\n6             7  Female   NaN                18.0                     6.0\n7             8  Female  23.0                18.0                    94.0\n8             9    Male  64.0                19.0                     3.0\n9            10  Female  30.0                19.0                    72.0\n10           11    Male  67.0                19.0                    14.0\n11           12  Female  35.0                19.0                    99.0\n12           13  Female  58.0                20.0                    15.0\n13           14  Female  24.0                20.0                    77.0\n14           15    Male  37.0                20.0                    13.0\n15           16    Male  22.0                20.0                    79.0\n16           17  Female  35.0                21.0                    35.0\n17           18    Male  20.0                21.0                    66.0\n18           19    Male  52.0                23.0                    29.0\n19           20  Female  35.0                23.0                    98.0\n20           21    Male  35.0                24.0                    35.0\n21           22    Male  25.0                24.0                    73.0\n22           23  Female  46.0                25.0                     5.0\n23           24    Male  31.0                25.0                    73.0\n24           25  Female  54.0                28.0                    14.0\n25           26    Male  29.0                28.0                    82.0\n26           27  Female  45.0                28.0                    32.0\n27           28    Male  35.0                28.0                    61.0\n28           29  Female  40.0                29.0                    31.0\n29           30  Female  23.0                29.0                    87.0\n30           31    Male  60.0                30.0                     4.0\n31           32  Female  21.0                30.0                    73.0\n32           33    Male  53.0                33.0                     4.0\n33           34    Male  18.0                33.0                    92.0\n34           35  Female  49.0                33.0                    14.0\n35           36  Female  21.0                33.0                    81.0\n36           37  Female  42.0                34.0                    17.0\n37           38  Female  30.0                34.0                    73.0\n38           39  Female  36.0                37.0                    26.0\n39           40  Female  20.0                37.0                    75.0\n40           41  Female  65.0                38.0                    35.0\n41           42    Male  24.0                38.0                    92.0\n42           43    Male  48.0                39.0                    36.0\n43           44  Female  31.0                39.0                    61.0\n44           45  Female  49.0                39.0                    28.0\n45           46  Female  24.0                39.0                    65.0\n46           47  Female  50.0                40.0                    55.0\n47           48  Female  27.0                40.0                    47.0\n48           49  Female  29.0                40.0                    42.0\n49           50  Female  31.0                40.0                    42.0\n50           51  Female  49.0                42.0                    52.0\n51           52    Male  33.0                42.0                    60.0\n52           53  Female  31.0                43.0                    54.0\n53           54    Male  59.0                43.0                    60.0\n54           55  Female  50.0                43.0                    45.0\n55           56    Male  47.0                43.0                    41.0\n56           57  Female  51.0                44.0                    50.0\n57           58    Male  69.0                44.0                    46.0\n58           59  Female  27.0                46.0                    51.0\n59           60    Male  53.0                46.0                    46.0\n60           61    Male  70.0                46.0                    56.0\n61           62    Male  19.0                46.0                    55.0\n62           63  Female  67.0                47.0                    52.0\n63           64  Female  54.0                47.0                    59.0\n64           65    Male  63.0                48.0                    51.0\n65           66    Male  18.0                48.0                    59.0\n66           67  Female  43.0                48.0                    50.0\n67           68  Female  68.0                48.0                    48.0\n68           69    Male  19.0                48.0                    59.0\n69           70  Female  32.0                48.0                    47.0\n70           71    Male  70.0                49.0                    55.0\n71           72  Female  47.0                49.0                    42.0\n72           73  Female  60.0                50.0                    49.0\n73           74  Female  60.0                50.0                    56.0\n74           75    Male  59.0                54.0                    47.0\n75           76    Male  26.0                54.0                    54.0\n76           77  Female  45.0                54.0                    53.0\n77           78    Male  40.0                54.0                    48.0\n78           79  Female  23.0                54.0                    52.0\n79           80  Female  49.0                54.0                    42.0\n80           81    Male  57.0                54.0                    51.0\n81           82    Male  38.0                54.0                    55.0\n82           83    Male  67.0                54.0                    41.0\n83           84  Female  46.0                54.0                    44.0\n84           85  Female  21.0                54.0                    57.0\n85           86    Male  48.0                54.0                    46.0\n86           87  Female  55.0                57.0                    58.0\n87           88  Female  22.0                57.0                    55.0\n88           89  Female  34.0                58.0                    60.0\n89           90  Female  50.0                58.0                    46.0\n90           91  Female  68.0                59.0                    55.0\n91           92    Male  18.0                59.0                    41.0\n92           93    Male  48.0                60.0                    49.0\n93           94  Female  40.0                60.0                    40.0\n94           95  Female  32.0                60.0                    42.0\n95           96    Male  24.0                60.0                    52.0\n96           97  Female  47.0                60.0                    47.0\n97           98  Female  27.0                60.0                    50.0\n98           99    Male  48.0                61.0                    42.0\n99          100    Male  20.0                61.0                    49.0\n100         101  Female  23.0                62.0                    41.0\n101         102  Female  49.0                62.0                    48.0\n102         103    Male  67.0                62.0                    59.0\n103         104    Male  26.0                62.0                    55.0\n104         105    Male  49.0                62.0                    56.0\n105         106  Female  21.0                62.0                    42.0\n106         107  Female  66.0                63.0                    50.0\n107         108    Male  54.0                63.0                    46.0\n108         109    Male  68.0                63.0                    43.0\n109         110    Male  66.0                63.0                    48.0\n110         111    Male  65.0                63.0                    52.0\n111         112  Female  19.0                63.0                    54.0\n112         113  Female  38.0                64.0                    42.0\n113         114    Male  19.0                64.0                    46.0\n114         115  Female  18.0                65.0                    48.0\n115         116  Female  19.0                65.0                    50.0\n116         117  Female  63.0                65.0                    43.0\n117         118  Female  49.0                65.0                    59.0\n118         119  Female  51.0                67.0                    43.0\n119         120  Female  50.0                67.0                    57.0\n120         121    Male  27.0                67.0                    56.0\n121         122  Female  38.0                67.0                    40.0\n122         123  Female  40.0                69.0                    58.0\n123         124    Male  39.0                69.0                    91.0\n124         125  Female  23.0                70.0                    29.0\n125         126  Female  31.0                70.0                    77.0\n126         127    Male  43.0                71.0                    35.0\n127         128    Male  40.0                71.0                    95.0\n128         129    Male  59.0                71.0                    11.0\n129         130    Male  38.0                71.0                    75.0\n130         131    Male  47.0                71.0                     9.0\n131         132    Male  39.0                71.0                    75.0\n132         133  Female  25.0                72.0                    34.0\n133         134  Female  31.0                72.0                    71.0\n134         135    Male  20.0                73.0                     5.0\n135         136  Female  29.0                73.0                    88.0\n136         137  Female  44.0                73.0                     7.0\n137         138    Male  32.0                73.0                    73.0\n138         139    Male  19.0                74.0                    10.0\n139         140  Female  35.0                74.0                    72.0\n140         141  Female  57.0                75.0                     5.0\n141         142    Male  32.0                75.0                    93.0\n142         143  Female  28.0                76.0                    40.0\n143         144  Female  32.0                76.0                    87.0\n144         145    Male  25.0                77.0                    12.0\n145         146    Male  28.0                77.0                    97.0\n146         147    Male  48.0                77.0                    36.0\n147         148  Female  32.0                77.0                    74.0\n148         149  Female  34.0                78.0                    22.0\n149         150    Male  34.0                78.0                    90.0\n150         151    Male  43.0                78.0                    17.0\n151         152    Male  39.0                78.0                    88.0\n152         153  Female  44.0                78.0                    20.0\n153         154  Female  38.0                78.0                    76.0\n154         155  Female  47.0                78.0                    16.0\n155         156  Female  27.0                78.0                    89.0\n156         157    Male  37.0                78.0                     1.0\n157         158  Female  30.0                78.0                    78.0\n158         159    Male  34.0                78.0                     1.0\n159         160  Female  30.0                78.0                    73.0\n160         161  Female  56.0                79.0                    35.0\n161         162  Female  29.0                79.0                    83.0\n162         163    Male  19.0                81.0                     5.0\n163         164  Female  31.0                81.0                    93.0\n164         165    Male  50.0                85.0                    26.0\n165         166  Female  36.0                85.0                    75.0\n166         167    Male  42.0                86.0                    20.0\n167         168  Female  33.0                86.0                    95.0\n168         169  Female  36.0                87.0                    27.0\n169         170    Male  32.0                87.0                    63.0\n170         171    Male  40.0                87.0                    13.0\n171         172    Male  28.0                87.0                    75.0\n172         173    Male  36.0                87.0                    10.0\n173         174    Male  36.0                87.0                    92.0\n174         175  Female  52.0                88.0                    13.0\n175         176  Female  30.0                88.0                    86.0\n176         177    Male  58.0                88.0                    15.0\n177         178    Male  27.0                88.0                    69.0\n178         179    Male  59.0                93.0                    14.0\n179         180    Male  35.0                93.0                    90.0\n180         181  Female  37.0                97.0                    32.0\n181         182  Female  32.0                97.0                    86.0\n182         183    Male  46.0                98.0                    15.0\n183         184  Female  29.0                98.0                    88.0\n184         185  Female  41.0                99.0                    39.0\n185         186    Male  30.0                99.0                    97.0\n186         187  Female  54.0               101.0                    24.0\n187         188    Male  28.0               101.0                    68.0\n188         189  Female  41.0               103.0                    17.0\n189         190  Female  36.0               103.0                    85.0\n190         191  Female  34.0               103.0                    23.0\n191         192  Female  32.0               103.0                    69.0\n192         193    Male  33.0               113.0                     8.0\n193         194  Female  38.0               113.0                    91.0\n194         195  Female  47.0               120.0                    16.0\n195         196  Female  35.0               120.0                    79.0\n196         197  Female  45.0               126.0                    28.0\n197         198    Male  32.0               126.0                    74.0\n198         199    Male  32.0               137.0                    18.0\n199         200    Male  30.0               137.0                    83.0'

In [83]:
dataset.head()

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                     NaN
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                16.0                     6.0
3           4  Female  23.0                 NaN                    77.0
4           5  Female   NaN                 NaN                    40.0

In [84]:
list(dataset.columns)

['CustomerID', 'Gender', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)']

In [85]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     197 non-null    float64
 3   Annual Income (k$)      198 non-null    float64
 4   Spending Score (1-100)  199 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 7.9+ KB

In [86]:
dataset.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  197.000000          198.000000              199.000000
mean   100.500000   39.000000           61.005051               50.256281
std     57.879185   14.002915           26.017857               25.876350
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   29.000000           42.250000               34.500000
50%    100.500000   36.000000           62.000000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [87]:
dataset.describe(include='object')

        Gender
count      200
unique       2
top     Female
freq       112

In [88]:
dataset.isnull().sum()

CustomerID                0
Gender                    0
Age                       3
Annual Income (k$)        2
Spending Score (1-100)    1
dtype: int64

In [89]:
dataset.isna().sum()/len(dataset)*100

CustomerID                0.0
Gender                    0.0
Age                       1.5
Annual Income (k$)        1.0
Spending Score (1-100)    0.5
dtype: float64

In [90]:
dataset.drop(4,inplace=True)
dataset.head()

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                     NaN
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                16.0                     6.0
3           4  Female  23.0                 NaN                    77.0
5           6  Female  22.0                17.0                    76.0

In [91]:
dataset.head()

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                     NaN
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                16.0                     6.0
3           4  Female  23.0                 NaN                    77.0
5           6  Female  22.0                17.0                    76.0

In [92]:
dataset.drop(dataset.index[[1,3]],inplace=True)
dataset.head()

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                     NaN
2           3  Female  20.0                16.0                     6.0
5           6  Female  22.0                17.0                    76.0
6           7  Female   NaN                18.0                     6.0
7           8  Female  23.0                18.0                    94.0

In [93]:
dataset.drop('CustomerID',axis=1,inplace=True)

In [94]:
dataset.drop(['Gender', 'Age'],axis=1, inplace=True)
dataset.head()

   Annual Income (k$)  Spending Score (1-100)
0                15.0                     NaN
2                16.0                     6.0
5                17.0                    76.0
6                18.0                     6.0
7                18.0                    94.0

In [95]:
dataset.rename({'CustomerID':"ID", 'Annual Income (k$)':"Salary"}, axis=1, inplace=True)
dataset.head()

   Salary  Spending Score (1-100)
0    15.0                     NaN
2    16.0                     6.0
5    17.0                    76.0
6    18.0                     6.0
7    18.0                    94.0

In [96]:
data_frame=pd.read_csv('Mall_Customers.csv')
data_frame.rename({'CustomerID':"ID", 'Gender':"Sex", 'Annual Income (k$)':"Salary"}, axis=1, inplace=True)
data_frame.head()

   ID     Sex   Age  Salary  Spending Score (1-100)
0   1    Male  19.0    15.0                     NaN
1   2    Male   NaN    15.0                    81.0
2   3  Female  20.0    16.0                     6.0
3   4  Female  23.0     NaN                    77.0
4   5  Female   NaN     NaN                    40.0

In [97]:
data_frame['Sex'] = data_frame['Sex'].map({'Male': 1 , 'Female': 2})
data_frame.head()

   ID  Sex   Age  Salary  Spending Score (1-100)
0   1    1  19.0    15.0                     NaN
1   2    1   NaN    15.0                    81.0
2   3    2  20.0    16.0                     6.0
3   4    2  23.0     NaN                    77.0
4   5    2   NaN     NaN                    40.0

In [98]:
data_frame=pd.read_csv('Mall_Customers.csv')

data_frame.rename({'CustomerID':"ID", 'Gender':"Sex", 'Annual Income (k$)':"Salary"}, axis=1, inplace=True)

data_frame.head()

   ID     Sex   Age  Salary  Spending Score (1-100)
0   1    Male  19.0    15.0                     NaN
1   2    Male   NaN    15.0                    81.0
2   3  Female  20.0    16.0                     6.0
3   4  Female  23.0     NaN                    77.0
4   5  Female   NaN     NaN                    40.0

In [99]:
data_frame['Sex'].unique()

array(['Male', 'Female'], dtype=object)

In [100]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()

label_encoder = preprocessing.LabelEncoder()
data_frame['Sex']= label_encoder.fit_transform(data_frame['Sex'])

data_frame.head()

   ID  Sex   Age  Salary  Spending Score (1-100)
0   1    1  19.0    15.0                     NaN
1   2    1   NaN    15.0                    81.0
2   3    0  20.0    16.0                     6.0
3   4    0  23.0     NaN                    77.0
4   5    0   NaN     NaN                    40.0

In [101]:
data_frame.rename({'Spending Score (1-100)':"Spending_Score"}, axis=1, inplace=True)
data_frame.head()

   ID  Sex   Age  Salary  Spending_Score
0   1    1  19.0    15.0             NaN
1   2    1   NaN    15.0            81.0
2   3    0  20.0    16.0             6.0
3   4    0  23.0     NaN            77.0
4   5    0   NaN     NaN            40.0

In [102]:
low_spenders_data= data_frame[data_frame.Spending_Score < 70]
low_spenders_data.describe()

               ID         Sex         Age      Salary  Spending_Score
count  145.000000  145.000000  143.000000  144.000000      145.000000
mean    97.193103    0.448276   42.321678   59.763889       38.020690
std     52.330188    0.499041   14.760340   23.184268       18.394772
min      3.000000    0.000000   18.000000   16.000000        1.000000
25%     57.000000    0.000000   31.000000   44.000000       22.000000
50%     93.000000    0.000000   43.000000   60.000000       42.000000
75%    135.000000    1.000000   52.500000   73.000000       52.000000
max    199.000000    1.000000   70.000000  137.000000       69.000000

In [103]:
high_eaners_low_spenders_data = data_frame[(data_frame.Salary > 70)&(data_frame.Spending_Score < 70)]
high_eaners_low_spenders_data.describe()

               ID        Sex        Age      Salary  Spending_Score
count   41.000000  41.000000  41.000000   41.000000       41.000000
mean   164.853659   0.560976  39.780488   88.170732       23.121951
std     21.489022   0.502433  11.118705   15.735156       17.996104
min    127.000000   0.000000  19.000000   71.000000        1.000000
25%    147.000000   0.000000  32.000000   77.000000       11.000000
50%    167.000000   1.000000  41.000000   86.000000       17.000000
75%    183.000000   1.000000  47.000000   98.000000       32.000000
max    199.000000   1.000000  59.000000  137.000000       69.000000

In [104]:
data_frame['newcolumn'] = 1
data_frame.head()

   ID  Sex   Age  Salary  Spending_Score  newcolumn
0   1    1  19.0    15.0             NaN          1
1   2    1   NaN    15.0            81.0          1
2   3    0  20.0    16.0             6.0          1
3   4    0  23.0     NaN            77.0          1
4   5    0   NaN     NaN            40.0          1

In [113]:
def stisfaction(value):
    if value > 70:
        return 'satis'
    else:
        return 'unsatis'

data_frame['cus_satisfaction']= data_frame['Spending_Score'].apply(stisfaction)
data_frame.head(10)

   ID     Sex   Age  Salary  Spending_Score  NewColumn cus_satisfaction
0   1    Male  19.0    15.0             NaN          1          unsatis
1   2    Male   NaN    15.0            81.0          1            satis
2   3  Female  20.0    16.0             6.0          1          unsatis
3   4  Female  23.0     NaN            77.0          1            satis
4   5  Female   NaN     NaN            40.0          1          unsatis
5   6  Female  22.0    17.0            76.0          1            satis
6   7  Female   NaN    18.0             6.0          1          unsatis
7   8  Female  23.0    18.0            94.0          1            satis
8   9    Male  64.0    19.0             3.0          1          unsatis
9  10  Female  30.0    19.0            72.0          1            satis

In [117]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 500)
data_frame.head(10)

   ID     Sex   Age  Salary  Spending_Score  NewColumn cus_satisfaction
0   1    Male  19.0    15.0             NaN          1          unsatis
1   2    Male   NaN    15.0            81.0          1            satis
2   3  Female  20.0    16.0             6.0          1          unsatis
3   4  Female  23.0     NaN            77.0          1            satis
4   5  Female   NaN     NaN            40.0          1          unsatis
5   6  Female  22.0    17.0            76.0          1            satis
6   7  Female   NaN    18.0             6.0          1          unsatis
7   8  Female  23.0    18.0            94.0          1            satis
8   9    Male  64.0    19.0             3.0          1          unsatis
9  10  Female  30.0    19.0            72.0          1            satis

In [118]:
data_frame.to_csv(r'preprocessed_data.csv', index = False)

In [106]:
# Re-read the data:
data_frame = pd.read_csv('Mall_Customers.csv')

# Ensure column renaming:
data_frame.rename({'CustomerID':"ID", 'Gender':"Sex", 'Annual Income (k$)':"Salary", 'Spending Score (1-100)':"Spending_Score"}, axis=1, inplace=True)

In [107]:
low_spenders_data= data_frame[data_frame.Spending_Score < 70]
low_spenders_data.describe()

               ID         Age      Salary  Spending_Score
count  145.000000  143.000000  144.000000      145.000000
mean    97.193103   42.321678   59.763889       38.020690
std     52.330188   14.760340   23.184268       18.394772
min      3.000000   18.000000   16.000000        1.000000
25%     57.000000   31.000000   44.000000       22.000000
50%     93.000000   43.000000   60.000000       42.000000
75%    135.000000   52.500000   73.000000       52.000000
max    199.000000   70.000000  137.000000       69.000000

In [108]:
data_frame.Salary

0       15.0
1       15.0
2       16.0
3        NaN
4        NaN
       ...
195    120.0
196    126.0
197    126.0
198    137.0
199    137.0
Name: Salary, Length: 200, dtype: float64

In [109]:
data_frame['NewColumn'] = 1
data_frame.head()

   ID     Sex   Age  Salary  Spending_Score  NewColumn
0   1    Male  19.0    15.0             NaN          1
1   2    Male   NaN    15.0            81.0          1
2   3  Female  20.0    16.0             6.0          1
3   4  Female  23.0     NaN            77.0          1
4   5  Female   NaN     NaN            40.0          1

In [110]:
data_frame.head()

   ID     Sex   Age  Salary  Spending_Score  NewColumn
0   1    Male  19.0    15.0             NaN          1
1   2    Male   NaN    15.0            81.0          1
2   3  Female  20.0    16.0             6.0          1
3   4  Female  23.0     NaN            77.0          1
4   5  Female   NaN     NaN            40.0          1

In [111]:
high_earns= data_frame[(data_frame.Salary > 59.7)&(data_frame.Spending_Score < 70)]
high_earns.describe()

               ID        Age      Salary  Spending_Score  NewColumn
count   73.000000  73.000000   73.000000       73.000000       73.0
mean   140.164384  40.068493   77.287671       34.027397        1.0
std     32.965476  13.849718   17.164627       18.828888        0.0
min     93.000000  18.000000   60.000000        1.000000        1.0
25%    111.000000  28.000000   63.000000       16.000000        1.0
50%    135.000000  40.000000   73.000000       39.000000        1.0
75%    170.000000  49.000000   87.000000       49.000000        1.0
max    199.000000  68.000000  137.000000       69.000000        1.0